app/controllers/add_events_controller.rb

  def index
    @add_events = AddEvent.all
---
SELECT "add_events".* FROM "add_events"