app/controllers/job_seekers_controller.rb

SELECT "job_seekers".* FROM "job_seekers"
---
  def index
    @job_seekers = JobSeeker.all