app/controllers/recruiters_controller.rb

  def index
    @recruiters = Recruiter.all
---
SELECT "recruiters".* FROM "recruiters"

    def set_recruiter
      @recruiter = Recruiter.find(params[:id])
---
SELECT "recruiters".* FROM "recruiters" WHERE "recruiters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]