app/models/job_seeker.rb

SELECT "events".* FROM "events" WHERE "events"."recruiter_id" = $1  [["recruiter_id", 1]]
SELECT "job_seekers".* FROM "job_seekers"
SELECT "recruiters".* FROM "recruiters" WHERE "recruiters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def recruiters
        self.events.collect{|event| event.recruiter}

SELECT "job_seekers".* FROM "job_seekers"
---
    def view_skills
        self.skills.collect{|skills| skills.name}

SELECT "events".* FROM "events" INNER JOIN "add_events" ON "events"."id" = "add_events"."event_id" WHERE "add_events"."job_seeker_id" = $1  [["job_seeker_id", 1]]
SELECT "job_seekers".* FROM "job_seekers"
---
    def view_events
        self.events.collect{|event| event.description}

SELECT "job_seekers".* FROM "job_seekers"
SELECT "recruiters".* FROM "recruiters"
---
    def all_matching_recruiters
        #main logic
        #look into all the skill name of this job_seeker, collect them in to an array =>job_seeker_skill_names
        #look into the skill instances of all the recruiters are looking for, store them into an array => all_recruiter_skills_flattened
        #loop thru both arrays and select the match base on skill_name, store the result into an array => matching
        #store all the profile_id of the matching result in to an array =>
        #sort  by count-of-occurrences => sorted_
        #use the sorted_ to find all the matching recruiter instances.

        job_seeker_skill_names = self.view_skills #=> array of skill_name

        all_recruiter_skills_flattened = Recruiter.all.map{|recruiter| recruiter.skills}.flatten #=> return an arr of skill instance

        matching = job_seeker_skill_names.map{|job_seeker_skill_name|
            all_recruiter_skills_flattened.select{
                |recruiter_skill| recruiter_skill.name == job_seeker_skill_name
            }
        }.flatten #=> return all the matching skill instance with profile_id

        matching_profile_id_arr = matching.map {|match| match.profile_id}

        #sort array by count-of-occurrences : https://stackoverflow.com/questions/10842210/sort-and-display-items-by-count-of-occurrences/10842419
        sorted_matching_profile_id_arr = matching_profile_id_arr.group_by{|x| x}.sort_by{|k, v| -v.size}.map(&:first)

        sorted_matching_recruitor_arr = sorted_matching_profile_id_arr.map{
            |matching_profile_id| Recruiter.all.select{

SELECT "events".* FROM "events" WHERE "events"."recruiter_id" = $1  [["recruiter_id", 2]]
SELECT "job_seekers".* FROM "job_seekers"
---
    def all_matching_events #just incase we need it
        self.all_matching_recruiters.map{|matching_recruiter| matching_recruiter.events}.flatten.map{|event| {event_date: event.event_date, location: event.location, company_name: event.recruiter.company_name, name: event.recruiter.name}}

SELECT "job_seekers".* FROM "job_seekers" INNER JOIN "add_events" ON "job_seekers"."id" = "add_events"."job_seeker_id" WHERE "add_events"."event_id" = $1  [["event_id", 6]]
---
    def matching_events_in_my_city #just incase we need it
        self.all_matching_events.select{|event| event.include?(self.location)}