app/models/recruiter.rb

    def view_skills
        self.skills.collect{|skills| skills.name}
---
SELECT "recruiters".* FROM "recruiters"

    def view_events
        self.events.collect{|event| event.description}
---
SELECT "events".* FROM "events" WHERE "events"."recruiter_id" = $1  [["recruiter_id", 1]]
SELECT "recruiters".* FROM "recruiters"

    def all_matching_job_seekers
        recruiter_skill_names = self.view_skills #=> array of skill_name

        all_job_seeker_skills_flattened = JobSeeker.all.map{|job_seeker| job_seeker.skills}.flatten #=> return an arr of skill instance

        matching = recruiter_skill_names.map{|recruiter_skill_name|
            all_job_seeker_skills_flattened.select{|job_seeker_skill| job_seeker_skill.name == recruiter_skill_name }
        }.flatten #=> return all the matching skill instance with profile_id

        mactching_profile_id_arr = matching.map {|match| match.profile_id}

        #sort array by count-of-occurrences : https://stackoverflow.com/questions/10842210/sort-and-display-items-by-count-of-occurrences/10842419
        sorted_mactching_profile_id_arr = mactching_profile_id_arr.group_by{|x| x}.sort_by{|k, v| -v.size}.map(&:first)
        sorted_matching_recruitor_arr = sorted_mactching_profile_id_arr.map{|matching_profile_id|
            JobSeeker.all.select{|job_seeker| job_seeker.profile.id == matching_profile_id}}.flatten #=>return the array of matching recruiter instance
---
SELECT "job_seekers".* FROM "job_seekers"
SELECT "recruiters".* FROM "recruiters"